MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DN128VFT5/mcu.h
#define RXWATER                       0x00007F80      // Receive Watermark


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RCFIFO register.
//
//*****************************************************************************

#define RXCOUNT                       0x00007F80      // Receive Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_C7816 register.
//
//*****************************************************************************

#define ONACK                         0x00000010      // Generate NACK on Overflow
#define ANACK                         0x00000008      // Generate NACK on Error
#define INIT                          0x00000004      // Detect Initial Character
#define TTYPE                         0x00000002      // Transfer Type
#define ISO_7816E                     0x00000001      // ISO-7816 Functionality Enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE7816 register.
//
//*****************************************************************************

#define WTE                           0x00000080      // Wait Timer Interrupt Enable
#define CWTE                          0x00000040      // Character Wait Timer Interrupt Enable
#define BWTE                          0x00000020      // Block Wait Timer Interrupt Enable
#define INITDE                        0x00000010      // Initial Character Detected Interrupt Enable
#define GTVE                          0x00000004      // Guard Timer Violated Interrupt Enable
#define TXTE                          0x00000002      // Transmit Threshold Exceeded Interrupt Enable
#define RXTE                          0x00000001      // Receive Threshold Exceeded Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IS7816 register.
//
//*****************************************************************************

#define WT                            0x00000080      // Wait Timer Interrupt
#define CWT                           0x00000040      // Character Wait Timer Interrupt
#define BWT                           0x00000020      // Block Wait Timer Interrupt
#define INITD                         0x00000010      // Initial Character Detected Interrupt
#define GTV                           0x00000004      // Guard Timer Violated Interrupt
#define TXT                           0x00000002      // Transmit Threshold Exceeded Interrupt
#define RXT                           0x00000001      // Receive Threshold Exceeded Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WP7816T0 register.
//
//*****************************************************************************

#define WI                            0x00007F80      // Wait Timer Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WP7816T1 register.
//
//*****************************************************************************

#define CWI                           0x00000780      // Character Wait Time Integer
#define BWI                           0x00000078      // Block Wait Time Integer


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WN7816 register.
//
//*****************************************************************************

#define GTN                           0x00007F80      // Guard Band N


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WF7816 register.
//
//*****************************************************************************

#define GTFD                          0x00007F80      // FD Multiplier


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_ET7816 register.
//
//*****************************************************************************

#define TXTHRESHOLD                   0x00000780      // Transmit NACK Threshold
#define RXTHRESHOLD                   0x00000078      // Receive NACK Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TL7816 register.
//
//*****************************************************************************

#define TLEN                          0x00007F80      // Transmit Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_C6 register.
//
//*****************************************************************************

#define EN709                         0x00000080      // Enables the CEA709.1-B feature
#define TX709                         0x00000040      // CEA709.1-B Transmit Enable
#define CE                            0x00000020      // Collision Enable
#define CP                            0x00000010      // Collision Signal Polarity


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PCTH register.
//
//*****************************************************************************

#define PCTH                          0x00007F80      // Packet Cycle Time Counter High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PCTL register.
//
//*****************************************************************************

#define PCTL                          0x00007F80      // Packet Cycle Time Counter Low
#define PCTL                          0x00000780      // Packet Cycle Time Counter Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_B1T register.
//
//*****************************************************************************

#define B1T                           0x00007F80      // Beta1 Timer


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTH register.
//
//*****************************************************************************

#define SDTH                          0x00007F80      // Secondary Delay Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTL register.
//
//*****************************************************************************

#define SDTL                          0x00007F80      // Secondary Delay Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PRE register.
//
//*****************************************************************************

